Tekla Open API Reference for Tekla Structures 2025
LineSegment.StartPoint Property
 Gets the start point of the line segment
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point StartPoint { get; }
Public ReadOnly Property StartPoint As Point
	Get
Property Value
Type: Point
Implements
ICurve.StartPoint
See Also
Reference
LineSegment Class
Tekla.Structures.Geometry3d Namespace